<template>
  <vue-masonry-wall :items="newsList" :options="options">
    <template v-slot:default="{ item }">
      <NewsCard :key="item.id" :news="item" />
    </template>
  </vue-masonry-wall>
</template>

<script>
import moment from "moment";
import NewsCard from "@/components/NewsCard.vue";
import VueMasonryWall from "vue-masonry-wall";

export default {
  name: "MasonryLayout",
  components: {
    VueMasonryWall,
    NewsCard,
  },
  data() {
    return {
      options: {
        width: 445,
        padding: {
          default: 12,
          2: 8,
          3: 8,
        },
      },
      newsList: [
        {
          id: 1,
          icon: "telegram.png",
          date: moment().subtract(1, "days"),
          text: [
            "Любви достойна только мама, а Золотого мяча 2021 года — Месси! В седьмой раз!",
            'В Париже в 65-й раз подвели итоги главной персональной премии для футболистов. В этот раз триумфатором стал игрок "Барселоны" "ПСЖ" Лионель Месси.',
            "Также премии получили: ",
            'Лучший молодой игрок — Педри, "Барселона"',
            'Лучший бомбардир года — Роберт Левандовски, "Бавария"',
            'Лучшая футболистка — Алексия Путельяс, "Барселона"',
            'Лучший вратарь — Джанлуиджи Доннарумма, "ПСЖ"',
            'Лучший клуб — "Челси"',
          ],
          image: "messi.png",
          group: "Mash",
          subscribersCount: 1252,
          newsLink: "",
        },
        {
          id: 2,
          icon: "twitter.png",
          date: moment().subtract(1, "days"),
          text: [
            "Марку Рудинштейну провели срочную операцию. Он находится в крайне тяжёлом состоянии.",
            '76-летнему кинопродюсеру и создателю премии "Кинотавр" провели трахеостомию — операцию по формированию искусственного отверстия в шее. Он остаётся на ИВЛ в реанимации. Вследствие обширного ишемического инсульта у Марка Григорьевича сильно поражён мозг.',
          ],
          image: "mark.png",
          group: "spark",
          subscribersCount: 1252,
          newsLink: "",
        },
        {
          id: 3,
          icon: "youtube.png",
          date: moment().subtract(1, "days"),
          text: [
            "Чао, Наполи! Московский Спартак прервал безвыигрышную серию и на своём поле обыграл гостей из Неаполя со счётом 2:1.",
            "Красно-белые повели уже на третьей минуте, благодаря забитому Соболевым пенальти, а на 28-й минуте увеличили разрыв, благодаря его же удару головой в левый угол ворот. В последние 20 минут фанатам всё-таки дали повод понервничать, пропустив в свои. Но Селихов сегодня включил режим стены и отражал всё, что мог отразить.",
            "Пока что у Спартака семь очков в группе C Лиги Европы.",
          ],
          image: "",
          group: "spark",
          subscribersCount: 1252,
          newsLink: "",
        },
        {
          id: 4,
          icon: "youtube.png",
          date: moment().subtract(1, "days"),
          text: [
            "Чао, Наполи! Московский Спартак прервал безвыигрышную серию и на своём поле обыграл гостей из Неаполя со счётом 2:1.",
            "Красно-белые повели уже на третьей минуте, благодаря забитому Соболевым пенальти, а на 28-й минуте увеличили разрыв, благодаря его же удару головой в левый угол ворот. В последние 20 минут фанатам всё-таки дали повод понервничать, пропустив в свои. Но Селихов сегодня включил режим стены и отражал всё, что мог отразить.",
            "Пока что у Спартака семь очков в группе C Лиги Европы.",
          ],
          image: "",
          group: "spark",
          subscribersCount: 1252,
          newsLink: "",
        },
        {
          id: 5,
          icon: "telegram.png",
          date: moment().subtract(1, "days"),
          text: [
            "Мособлдума потратит 300 миллионов в год на машины для 50 депутатов",
            "По закону избранникам нельзя покупать авто дороже 2,5 лямов. Но если вы ждали, что мужчины в строгих костюмах пересядут на Ford Focus, то зря вы этого ждали. Законотворцы придумали кое-что поинтереснее: машины вместе с водителями берут в аренду, ведь там ограничений нет.",
            "Выразительное дает инвариант. Целое образа многопланово просветляет общекультурный цикл. Одиночество однократно. Очевидно, что общекультурный",
          ],
          image: "photo-x2.png",
          group: "spark",
          subscribersCount: 1252,
          newsLink: "",
        },
      ],
    };
  },
};
</script>